# brew bundle

# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# CL applications
brew "coreutils"
brew "git"
brew "ffmpeg"
brew "jpegoptim"
brew "libyaml"
brew "mas"
brew "node"
brew "nginx"
brew "pipenv"
brew "pngcrush"
brew "svg" # for fonts, below
brew "wget"
brew "webp"
brew "xz"
brew "zlib"
brew "sqlite"
brew "unrar"
brew "x264"
brew "x265"

# GUI applications
cask "brave-browser"
cask "google-chrome"
cask "opera"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "google-backup-and-sync"
cask "handbrake"
cask "sketch"
cask "slack"
cask "spotify"
cask "transmission"
cask "vlc"
cask "visual-studio-code"


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


# Mac App Store applications
mas "Magnet", id: 441258766
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Transmit 5", id: 1436522307
mas "Pages", id: 409201541

